# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeSettingIterator..::..Dispose Method
DuctSizeSettingIterator Class See Also
---
Releases all resources used by the DuctSizeSettingIterator
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
DuctSizeSettingIterator Class
Autodesk.Revit.DB.Mechanical Namespace